# for 반복문
# for 변수명 in [, ,]<-리스트임 자바에 배열같은거임
# 리스트안에 있는 내용을 반복해서 하나씩 출력함
for n in [1, 2, 3]:
    print(n)


# for 문자열 (문자열도 인덱스가있음)
for c in '홍길동':
    print(c)

# range() for문과 함께자주사용되는 내장함수
# range(시작값,끝값)
# 문자열 슬라이싱한거와 비슷함
# range(3) 시작값이 없는경우 0~끝값전까지 반복
for i in range(3):
    print(i)

# range(5,9)는 시작값에서 부터 끝값전까지 반복출력됨
for i in range(5, 9):
    print(i)


# 구구단2단
# for i in range(1, 10):
#     print(f'2 x {i} = {2*i}')


# for i in range(2, 10):
#     print('\n')
#     for j in range(1, 10):
#         print(f'{i} x {j} ={i*j}')


# 예제

i = 1
result = 0

while i <= 1000:
    if i % 3 == 0:
        result += i
    i += 1

print(result)


n = 5
i = 1

while i <= n:
    print('*'*i)
    i += 1
print()

# for i in range(1, n+1):
#     print('*'*i)
#     i += 1
# print()

print('''
*******************************************************************************
          |                   |                  |                     |
 _________|________________.=""_;=.______________|_____________________|_______
|                   |  ,-"_,=""     `"=.|                  |
|___________________|__"=._o`"-._        `"=.______________|___________________
          |                `"=._o`"=._      _`"=._                     |
 _________|_____________________:=._o "=._."_.-="'"=.__________________|_______
|                   |    __.--" , ; `"=._o." ,-"""-._ ".   |
|___________________|_._"  ,. .` ` `` ,  `"-._"-._   ". '__|___________________
          |           |o`"=._` , "` `; .". ,  "-._"-._; ;              |
 _________|___________| ;`-.o`"=._; ." ` '`."\` . "-._ /_______________|_______
|                   | |o;    `"-.o`"=._``  '` " ,__.--o;   |
|___________________|_| ;     (#) `-.o `"=.`_.--"_o.-; ;___|___________________
____/______/______/___|o;._    "      `".o|o_.--"    ;o;____/______/______/____
/______/______/______/_"=._o--._        ; | ;        ; ;/______/______/______/_
____/______/______/______/__"=._o--._   ;o|o;     _._;o;____/______/______/____
/______/______/______/______/____"=._o._; | ;_.--"o.--"_/______/______/______/_
____/______/______/______/______/_____"=.o|o_.--""___/______/______/______/____
/______/______/______/______/______/______/______/______/______/______/_____ /
*******************************************************************************
''')
print("보물섬에 오신 것을 환영합니다.")
print("보물을 찾아보세요")

choice1 = input("당신은 갈림길을 만났습니다.\n왼쪽 또는 오른쪽을 적어서 선택 :")
if choice1 == "왼쪽":
    # 게임을 계속한다.
    print("갈림길을 잘 통과했습니다.")
    # 다음 선택 코드를 계속 만듭니다.
    choice2 = input("이번엔 수영 또는 대기를 적어서 선택 : ")
    if choice2 == "대기":
        choice3 = input("문의 색을 선택해 적어주세요.\n빨간색, 파란색, 노란색 중 선택 : ")
        if choice3 == "노란색":
            print('축하합니다. 승리!')
        elif choice3 == "빨간색":
            print('불에 타서 사망')
        elif choice3 == "파란색":
            print('괴물에게 먹힘 사망')
        else:
            print('게임오버')
    else:
        print('상어의 공격으로 사망')
else:
    print("당신은 함정에 빠져 사망했습니다.")
